chore: changed ASCII diagrams to Mermaid
